/*
 * @version: 
 * @Author: LHF
 * @Date: 2021-05-22 10:11:04
 * @LastEditors: LHF
 * @LastEditTime: 2021-05-24 10:27:41
 */
const provincesText = [
    "上海",
    "河北",
    "山西",
    "内蒙古",
    "辽宁",
    "吉林",
    "黑龙江",
    "江苏",
    "浙江",
    "安徽",
    "福建",
    "江西",
    "山东",
    "河南",
    "湖北",
    "湖南",
    "广东",
    "广西",
    "海南",
    "四川",
    "贵州",
    "云南",
    "西藏",
    "陕西",
    "甘肃",
    "青海",
    "宁夏",
    "新疆",
    "北京",
    "天津",
    "重庆",
    "香港",
    "澳门",
    "台湾",
];
const provinces = [
    "shanghai",
    "hebei",
    "shanxi",
    "neimenggu",
    "liaoning",
    "jilin",
    "heilongjiang",
    "jiangsu",
    "zhejiang",
    "anhui",
    "fujian",
    "jiangxi",
    "shandong",
    "henan",
    "hubei",
    "hunan",
    "guangdong",
    "guangxi",
    "hainan",
    "sichuan",
    "guizhou",
    "yunnan",
    "xizang",
    "shanxi1",
    "gansu",
    "qinghai",
    "ningxia",
    "xinjiang",
    "beijing",
    "tianjin",
    "chongqing",
    "xianggang",
    "aomen",
    "taiwan",
];
const geoCoordsMap = {
    杭州: [119.5313, 29.8773],
    // 江苏: [118.814396, 32.070938],
    // 福建: [118.814396, 32.070938],
    // 云南: [102.9199, 25.4663],
    // 辽宁: [123.448242, 41.818461],
    // 黑龙江: [126.719099, 45.7944],
    // 吉林: [123.448242, 41.818461],
    // 海南: [110.190537, 20.055958],
    // 江西: [123.448242, 41.818461],
    // 山东: [117.115404, 36.66073],
    // 重庆: [106.556137, 29.557686],
    // 河北: [114.4995, 38.1006],
    // 新疆: [87.610478, 43.831501],
    // 山西: [112.556728, 37.8714],
    // 上海: [121.4648, 31.2891],
    // 广东: [113.8953, 22.901],
    // 乌鲁木齐: [87.9236, 43.5883],
    // 兰州: [103.5901, 36.3043],
    // 北京: [116.4551, 40.2539],
    // 南京: [118.8062, 31.9208],
    // 南昌: [116.0046, 28.6633],
    // 厦门: [118.1689, 24.6478],
    // 合肥: [117.29, 32.0581],
    // 呼和浩特: [111.4124, 40.4901],
    // 哈尔滨: [127.9688, 45.368],
    // 天津: [117.4219, 39.4189],
    // 太原: [112.3352, 37.9413],
    // 广州: [113.5107, 23.2196],
    // 成都: [103.9526, 30.7617],
    // 拉萨: [91.1865, 30.1465],
    // 昆明: [102.9199, 25.4663],
    // 武汉: [114.3896, 30.6628],
    // 沈阳: [123.1238, 42.1216],
    // 济南: [117.1582, 36.8701],
    // 深圳: [114.5435, 22.5439],
    // 温州: [120.498, 27.8119],
    // 石家庄: [114.4995, 38.1006],
    // 福州: [119.4543, 25.9222],
    // 绍兴: [120.564, 29.7565],
    // 苏州: [120.6519, 31.3989],
    // 西安: [109.1162, 34.2004],
    // 郑州: [113.4668, 34.6234],
    // 重庆: [107.7539, 30.1904],
    // 长沙: [113.0823, 28.2568],
    // 青岛: [120.4651, 36.3373],
    // 宁夏: [106.183394, 38.501957],
    // 陕西: [108.7149, 34.330438],
    // 湖北: [114.3896, 30.6628],
    // 安徽: [117.233378, 31.823435],
    上海:[121.4648,31.0891],
    河北:[115.4004,37.8688],
    山西:[112.4121,37.6611],
    内蒙古:[112.5977,42.3408],
    辽宁:[123.448242, 41.818461],
    吉林:[125.7746,43.5938],
    黑龙江:[126.719099, 45.7944],
    江苏:[119.5586,32.915],
    浙江:[120.498,29.0918],
    安徽:[117.2461,32.0361],
    福建:[118.3008,25.9277],
    江西:[116.0156,27.29],
    山东:[118.7402,36.4307],
    河南:[113.0668,33.8818],
    湖北:[112.2363,31.1572],
    湖南:[111.5332,27.3779],
    广东:[113.4668,22.8076],
    广西:[107.7813,23.6426],
    海南:[109.9512,19.2041],
    四川:[101.9199,30.1904],
    贵州:[106.6113,26.9385],
    云南:[101.0652,25.1807],
    西藏:[87.8695,31.6846],
    陕西:[109.5996,35.7396],
    甘肃:[100.7129,38.166],
    青海:[95.2402,35.4199],
    宁夏:[105.9961,37.3096],
    新疆:[84.9023,42.148],
    北京:[116.4551,39.8539],
    天津:[117.9219,38.7189],
    重庆:[107.7539,30.1904],
    香港:[116.8178,21.8242],
    澳门:[114.5547,20.6484],
    台湾: [121.0254,23.5986]
}
const points = [
    {value: [118.8062, 31.9208],itemStyle:{color:'#4ab2e5'}}
    , {value: [127.9688, 45.368],itemStyle:{color:'#4fb6d2'}}
    , {value: [110.3467, 41.4899],itemStyle:{color:'#52b9c7'}}
    , {value: [125.8154, 44.2584],itemStyle:{color:'#5abead'}}
    , {value: [116.4551, 40.2539],itemStyle:{color:'#f34e2b'}}
    , {value: [123.1238, 42.1216],itemStyle:{color:'#f56321'}}
    , {value: [114.4995, 38.1006],itemStyle:{color:'#f56f1c'}}
    , {value: [117.4219, 39.4189],itemStyle:{color:'#f58414'}}
    , {value: [112.3352, 37.9413],itemStyle:{color:'#f58f0e'}}
    , {value: [109.1162, 34.2004],itemStyle:{color:'#f5a305'}}
    , {value: [103.5901, 36.3043],itemStyle:{color:'#e7ab0b'}}
    , {value: [106.3586, 38.1775],itemStyle:{color:'#dfae10'}}
    , {value: [101.4038, 36.8207],itemStyle:{color:'#d5b314'}}
    , {value: [103.9526, 30.7617],itemStyle:{color:'#c1bb1f'}}
    , {value: [108.384366, 30.439702],itemStyle:{color:'#b9be23'}}
    , {value: [113.0823, 28.2568],itemStyle:{color:'#a6c62c'}}
    , {value: [102.9199, 25.46639],itemStyle:{color:'#96cc34'}}
    , {value: [119.4543, 25.9222]}
]
const HZData = [
    // [{ name: "杭州" }, { name: "湖北", value: 95,lineStyle: '#4ab2e5'}],
    // [{ name: "杭州" }, { name: "山西", value: 90,lineStyle: '#4fb6d2' }],
    // [{ name: "杭州" }, { name: "上海", value: 65 }],
    // [{ name: "杭州" }, { name: "江苏", value: 60 }],
    // [{ name: "杭州" }, { name: "福建", value: 55 }],
    // [{ name: "杭州" }, { name: "宁夏", value: 50 }],
    // [{ name: "杭州" }, { name: "吉林", value: 15 ,lineStyle: '#f58414'}],
    [{ name: "杭州" }, { name: "辽宁", value: 8,lineStyle: '#52b9c7'}],
    [{ name: "杭州" }, { name: "黑龙江", value: 8,lineStyle: '#5abead'}],
    [{ name: "杭州" }, { name: "广东", value: 8,lineStyle: '#f34e2b'}],
    [{ name: "杭州" }, { name: "河北", value: 8,lineStyle: '#f56321'}],
    [{ name: "杭州" }, { name: "北京", value: 8 ,lineStyle: '#f56f1c'}],
    [{ name: "杭州" }, { name: "陕西", value: 8,lineStyle: '#f58414'}],
    [{ name: "杭州" }, { name: "海南", value: 8 ,lineStyle: '#f56f1c'}],
    [{ name: "杭州" }, { name: "新疆", value: 8 ,lineStyle: '#f56321'}],
    [{ name: "杭州" }, { name: "云南", value: 8 ,lineStyle: '#4ab2e5'}],
    [{ name: "杭州" }, { name: "重庆", value: 8 ,lineStyle: '#e7ab0b'}],
    [{ name: "杭州" }, { name: "杭州", value: 8 ,lineStyle: '#f58f0e'}],
];
var Points = [
    // {value: [123.448242, 41.818461],itemStyle:{color:'#4ab2e5'}}
    // , {value: [126.719099, 45.7944],itemStyle:{color:'#4fb6d2'}}
    // , {value: [102.9199, 25.4663],itemStyle:{color:'#52b9c7'}}
    // , {value: [123.448242, 41.818461],itemStyle:{color:'#f34e2b'}}
    // , {value: [110.190537, 20.055958],itemStyle:{color:'#f56f1c'}}
    // , {value: [123.448242, 41.818461],itemStyle:{color:'#f58414'}}
    // , {value: [117.115404, 36.66073],itemStyle:{color:'#f58f0e'}}
    // , {value: [106.556137, 29.557686],itemStyle:{color:'#f5a305'}}
    // , {value: [114.4995, 38.1006],itemStyle:{color:'#e7ab0b'}}
    // , {value: [119.5313, 29.8773]}
    // , {value: [106.3586, 38.1775],itemStyle:{color:'#dfae10'}}
    // , {value: [101.4038, 36.8207],itemStyle:{color:'#d5b314'}}
    // , {value: [103.9526, 30.7617],itemStyle:{color:'#c1bb1f'}}
    // , {value: [108.384366, 30.439702],itemStyle:{color:'#b9be23'}}
    // , {value: [113.0823, 28.2568],itemStyle:{color:'#a6c62c'}}
    // , {value: [102.9199, 25.46639],itemStyle:{color:'#96cc34'}}
    // , {value: [123.1238, 42.1216],itemStyle:{color:'#f56321'}}
    // , {value: [123.448242, 41.818461],itemStyle:{color:'#5abead'}}
]
export default {
    provincesText,
    provinces,
    geoCoordsMap,
    points,
    HZData
}